{
  "1.0.4": {
    "en": "Added ELKO Smart Plug"
  },
  "1.0.5": {
    "en": "Added ELKO Smart Plug"
  },
  "1.0.6": {
    "en": "Added support for ELKO Smart Wirless Switch"
  },
  "1.0.7": {
    "en": "Added error handling to prevent some device to get unavailable."
  },
  "1.0.8": {
    "en": "Added error handling to prevent some devices to get unavailable"
  },
  "1.0.9": {
    "en": "Added error handling to prevent some devices to get unavailable"
  },
  "1.0.10": {
    "en": "Redesigned Power meter and metering. It now uses the defined thermostat load in settings to calculate the metering based on relay. Power meter uses defined load to give a more preciese value in Energy tab. Fixed a error with regulator mode and flow. Fixed a error not able to set Power status on unit in flows"
  },
  "1.1.0": {
    "en": "Fixed kWh bug, returned to old logic. Added SmartStikkDobbel & SmartStikkEnkel. Added Multiwire dimmer id's to code. Made preperations for PIR devices."
  },
  "1.1.1": {
    "en": "Fixed kWh bug, returned to old logic. Added SmartStikkDobbel & SmartStikkEnkel. Added Multiwire dimmer id's to code. Made preperations for PIR devices. Fixed pairing instructions"
  },
  "1.1.2": {
    "en": "Fixed kWh bug, returned to old logic. Added SmartStikkDobbel & SmartStikkEnkel. Added Multiwire dimmer id's to code. Made preperations for PIR devices. Fixed pairing instructions"
  },
  "1.1.3": {
    "en": "Fixing termostat bug"
  },
  "1.1.4": {
    "en": "Added new devices, cleaned up some code"
  },
  "1.1.5": {
    "en": "Added new devices, cleaned up some code"
  },
  "1.1.6": {
    "en": "Added new devices, cleaned up some code"
  },
  "1.1.7": {
    "en": "Added support for new ELKO Smart Multiwire dimmers, smart sockets, pir dimmer and switch. Fixed power metering bug on thermostat and max_floor_temp bug. When adding thermostats in future please go to Advanced settings to set all settings to get correct power, temperature reports, and also correct functionality regarding thermostat or regulator."
  },
  "1.1.8": {
    "en": "Building and fixing settings, some work under the hood making it more stabile, if you are using Super TR Thermostat as regulator, please readd as Super TR regulator device."
  },
  "1.1.9": {
    "en": "Updated settings handling on all devices. Rebuilt settings on Thermostat. Better handling on Thermostat <-> Regulator change. Introduced new ELKO Smart devices. Multiwire turn dimmer added as own device to add settings"
  },
  "1.1.11": {
    "en": "Bug fixes on Super TR"
  },
  "1.1.12": {
    "en": "Bug fixes on Super TR"
  }
}
